validation-seabed-scouring-by-square-jet/deycase-1/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.005;
    }
    
    "(right|top)"
    {
       type             zeroGradient;
    }
    
    "(side1|side2)"
    {
        type            empty;
    }
    
    "(down|hWall|left|slipWall)"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }


}


// ************************************************************************* //
